surfaceWater/runCases/RANS/MeshSelection4/3mmx0.2mm/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
1056
(
(0.0173738 0.00275597 2.04062e-25)
(0.0175424 0.00277602 2.10152e-25)
(0.0231251 0.0033677 5.08839e-26)
(0.0236931 0.00342574 4.35949e-26)
(0.0329992 0.00418875 -3.82345e-22)
(0.0334563 0.00419211 -3.71911e-22)
(0.0393272 0.00411936 9.38247e-24)
(0.0398401 0.00408268 9.22278e-24)
...
)
;

boundaryField
{
    back
    {
        type            empty;
    }
    bottom
    {
        type            noSlip;
    }
    right
    {
        type            cyclicAMI;
        value           nonuniform List<vector> 
32
(
(0.00847064 0.00148773 9.21264e-25)
(0.00847064 0.00148773 9.21264e-25)
(0.0219018 0.00306437 -1.84535e-20)
(0.0219018 0.00306437 -1.84535e-20)
(0.0293233 0.00323583 8.67499e-21)
(0.0293233 0.00323583 8.67499e-21)
(0.0346195 0.00291089 -1.63034e-25)
(0.0346195 0.00291089 -1.63034e-25)
...
)
;
    }
    top
    {
        type            zeroGradient;
    }
    left
    {
        type            cyclicAMI;
        value           nonuniform List<vector> 
32
(
(0.00847064 0.00148773 9.21264e-25)
(0.00847064 0.00148773 9.21264e-25)
(0.0219018 0.00306437 -1.84535e-20)
(0.0219018 0.00306437 -1.84535e-20)
(0.0293233 0.00323583 8.67499e-21)
(0.0293233 0.00323583 8.67499e-21)
(0.0346195 0.00291089 -1.63034e-25)
(0.0346195 0.00291089 -1.63034e-25)
...
)
;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
