surfaceWater/runCases/RANS/MeshSelection4/3mmx0.2mm/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
1056
(
595.906
586.107
388.467
365.829
75.4011
71.1497
32.3197
30.9573
...
)
;

boundaryField
{
    back
    {
        type            empty;
    }
    bottom
    {
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
33
(
915.073
915.073
957.033
993.538
993.538
1017.96
1017.96
1028.08
...
)
;
    }
    right
    {
        type            cyclicAMI;
        value           nonuniform List<scalar> 
32
(
902.766
902.766
137.34
137.34
45.5275
45.5275
26.2553
26.2553
...
)
;
    }
    top
    {
        type            zeroGradient;
    }
    left
    {
        type            cyclicAMI;
        value           nonuniform List<scalar> 
32
(
902.766
902.766
137.34
137.34
45.5275
45.5275
26.2553
26.2553
...
)
;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
